zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/src/stm32mp2xx_hal.c
/** @defgroup HAL_Exported_Functions_Group4 HDP Peripheral Control functions
  *
  * @{
  */

/**
  * @brief  Enable the HDP[7:0] output
  * @note   Valid if HDP also enabled in BSEC
  * @retval None
  */
void HAL_HDP_EnableHDP(void)
{
  SET_BIT(HDP->CTRL, HDP_CTRL_EN);
}

/**
  * @brief  Disable the HDP[7:0] output.
  * @retval None
  */
void HAL_HDP_DisableHDP(void)
{
  CLEAR_BIT(HDP->CTRL, HDP_CTRL_EN);
}

/**
  * @brief  Select the output among the 16 available signals for each mux
  * @param  HDP_Mux This value is one of @ref HDP_Mux
  * @param  HDP_Signal This value is one of @ref HDP_Signal
  * @retval None
  */
void HAL_HDP_ConfigHDPMux(uint32_t HDP_Mux, uint32_t HDP_Signal)
{
  MODIFY_REG(HDP->MUX, HDP_Mux, HDP_Signal);
}

/**
  * @brief  Return the output of VAL register
  * @retval Value of VAL register
  */
uint32_t HAL_HDP_ReadVAL(void)
{
  return ((HDP->VAL) & (HDP_VAL_HDPVAL));
}
/**
  * @}
  */


/** @defgroup HAL_Exported_Functions_Group5 SYSCFG Peripheral Control functions
  *
  * @{
  */


/**
  * @brief  Ethernet PHY Interface Selection either MII, RMII or RGMII
  * @param  SYSCFG_ETHInterface: Selects the Ethernet 1 PHY interface
  *   This parameter can be one of the following values:
  *   @arg SYSCFG_ETH_MII : Select the Media Independent Interface
  *   @arg SYSCFG_ETH_RGMII : Select the reduced gigabit media-independent interface
  *   @arg SYSCFG_ETH_RMII: Select the Reduced Media Independent Interface
  * @retval None
  */
void HAL_SYSCFG_ETH1InterfaceSelect(uint32_t SYSCFG_ETHInterface)
{
  assert_param(IS_SYSCFG_ETHERNET_CONFIG(SYSCFG_ETHInterface));

  MODIFY_REG(SYSCFG->ETH1CR, SYSCFG_ETH1CR_ETH1_SEL, (uint32_t)(SYSCFG_ETHInterface));
}

/**
  * @brief  Ethernet PHY Interface Selection either MII, RMII or RGMII
  * @param  SYSCFG_ETHInterface: Selects the Ethernet 2 PHY interface
  *   This parameter can be one of the following values:
  *   @arg SYSCFG_ETH_MII : Select the Media Independent Interface
  *   @arg SYSCFG_ETH_RGMII : Select the reduced gigabit media-independent interface
  *   @arg SYSCFG_ETH_RMII: Select the Reduced Media Independent Interface
  * @retval None
  */
void HAL_SYSCFG_ETH2InterfaceSelect(uint32_t SYSCFG_ETHInterface)
{
  assert_param(IS_SYSCFG_ETHERNET_CONFIG(SYSCFG_ETHInterface));

  MODIFY_REG(SYSCFG->ETH2CR, SYSCFG_ETH2CR_ETH2_SEL, (uint32_t)(SYSCFG_ETHInterface));
}

/**
  * @brief  Ethernet RGMII 125 MHz Clock Selection
  * @param  SYSCFG_ETHClock: Selects the RGMII Ethernet Clock
  *   This parameter can be one of the following values:
  *   @arg SYSCFG_ETH_EXT_CLK : Select the External Clock
  *   @arg SYSCFG_ETH_RCC_CLK : Select the RCC Internal Clock
  * @retval None
  */
void HAL_SYSCFG_ETH1ClockSelect(uint32_t SYSCFG_ETHClock)
{
  assert_param(IS_SYSCFG_ETHERNET_CLOCK_CONFIG(SYSCFG_ETHClock));

  MODIFY_REG(SYSCFG->ETH1CR, SYSCFG_ETH1CR_ETH1_CLK_SEL, (uint32_t)(SYSCFG_ETHClock));
}

/**
  * @brief  Ethernet RMII 50 MHz Clock Selection
  * @param  SYSCFG_ETHClock: Selects the RMII Ethernet Clock
  *   This parameter can be one of the following values:
  *   @arg SYSCFG_ETH_EXT_CLK : Select the External Clock
  *   @arg SYSCFG_ETH_RCC_CLK : Select the RCC Internal Clock
  * @retval None
  */
void HAL_SYSCFG_ETH1RefClockSelect(uint32_t SYSCFG_ETHClock)
{
  assert_param(IS_SYSCFG_ETHERNET_CLOCK_CONFIG(SYSCFG_ETHClock));

  MODIFY_REG(SYSCFG->ETH1CR, SYSCFG_ETH1CR_ETH1_REF_CLK_SEL, (uint32_t)(SYSCFG_ETHClock));
}

/**
  * @brief  Ethernet RGMII 125 MHz Clock Selection
  * @param  SYSCFG_ETHClock: Selects the RGMII Ethernet Clock
  *   This parameter can be one of the following values:
  *   @arg SYSCFG_ETH_EXT_CLK : Select the External Clock
  *   @arg SYSCFG_ETH_RCC_CLK : Select the RCC Internal Clock
  * @retval None
  */
void HAL_SYSCFG_ETH2ClockSelect(uint32_t SYSCFG_ETHClock)
{
  assert_param(IS_SYSCFG_ETHERNET_CLOCK_CONFIG(SYSCFG_ETHClock));

  MODIFY_REG(SYSCFG->ETH2CR, SYSCFG_ETH2CR_ETH2_CLK_SEL, (uint32_t)(SYSCFG_ETHClock));
}

/**
  * @brief  Ethernet RMII 50 MHz Clock Selection
  * @param  SYSCFG_ETHClock: Selects the RMII Ethernet Clock
  *   This parameter can be one of the following values:
  *   @arg SYSCFG_ETH_EXT_CLK : Select the External Clock
  *   @arg SYSCFG_ETH_RCC_CLK : Select the RCC Internal Clock
  * @retval None
  */
void HAL_SYSCFG_ETH2RefClockSelect(uint32_t SYSCFG_ETHClock)
{
  assert_param(IS_SYSCFG_ETHERNET_CLOCK_CONFIG(SYSCFG_ETHClock));

  MODIFY_REG(SYSCFG->ETH2CR, SYSCFG_ETH2CR_ETH2_REF_CLK_SEL, (uint32_t)(SYSCFG_ETHClock));
}

/**
  * @brief  Analog Switch control for analog connections.
  * @param  SYSCFG_AnalogSwitch: Selects the analog pad
  *   This parameter can be one or a combination of the following values:
  *   @arg SYSCFG_SWITCH_PA0 : Select PA0 analog switch
  *   @arg SYSCFG_SWITCH_PA1:  Select PA1 analog switch
  * @param  SYSCFG_SwitchState: Open or Close the analog switch between pads
  *   This parameter can be one or a combination of the following values:
  *   @arg SYSCFG_SWITCH_PA0_OPEN
  *   @arg SYSCFG_SWITCH_PA0_CLOSE
  *   @arg SYSCFG_SWITCH_PA1_OPEN
  *   @arg SYSCFG_SWITCH_PA1_CLOSE
  * @retval None
  */
#if defined(SYSCFG_IOCR_HSLVEN_TRACE)
void HAL_SYSCFG_AnalogSwitchConfig(uint32_t SYSCFG_AnalogSwitch, uint32_t SYSCFG_SwitchState)
{
  /* Check the parameter */
  assert_param(IS_SYSCFG_SWITCH_STATE(SYSCFG_SwitchState));
  assert_param(IS_SYSCFG_ANALOG_SWITCH(SYSCFG_AnalogSwitch));
  if ((SYSCFG_AnalogSwitch & SYSCFG_SWITCH_PA0) == SYSCFG_SWITCH_PA0)
  {
    MODIFY_REG(SYSCFG->IOCR, SYSCFG_IOCR_ANA0_SEL, (uint32_t)(SYSCFG_SwitchState));
  }
  if ((SYSCFG_AnalogSwitch & SYSCFG_SWITCH_PA1) == SYSCFG_SWITCH_PA1)
  {
    MODIFY_REG(SYSCFG->IOCR, SYSCFG_IOCR_ANA1_SEL, (uint32_t)(SYSCFG_SwitchState));
  }
}

/**
  * @brief  To Enable optimize the I/O speed when the product voltage is low.
  * @note   This bit is active only if PRODUCT_BELOW_25V user option bit is set. It must be
  *         used only if the product supply voltage is below 2.5 V. Setting this bit when VDD is
  *         higher than 2.5 V might be destructive.
  * @param  SYSCFG_HighSpeedSignal: Signal selection (TRACE, OCTOSPI...)
  *   This parameter can be one or a combination of the following values:
  *   @arg SYSCFG_HIGHSPEED_TRACE_SIGNAL
  *   @arg SYSCFG_HIGHSPEED_LCD_SIGNAL
  *   @arg SYSCFG_HIGHSPEED_OCTOSPIM_P1_SIGNAL
  *   @arg SYSCFG_HIGHSPEED_OCTOSPIM_P2_SIGNAL
  *   @arg SYSCFG_HIGHSPEED_ETH1_SIGNAL
  *   @arg SYSCFG_HIGHSPEED_ETH2_SIGNAL
  *   @arg SYSCFG_HIGHSPEED_ETH3_SIGNAL
  *   @arg SYSCFG_HIGHSPEED_SDMMC3_SIGNAL
  *   @arg SYSCFG_HIGHSPEED_SPI1_SIGNAL
  *   @arg SYSCFG_HIGHSPEED_SPI2_SIGNAL
  *   @arg SYSCFG_HIGHSPEED_SPI3_SIGNAL
  *   @arg SYSCFG_HIGHSPEED_SPI4_SIGNAL
  *   @arg SYSCFG_HIGHSPEED_SPI5_SIGNAL
  *   @arg SYSCFG_HIGHSPEED_SPI6_SIGNAL
  *   @arg SYSCFG_HIGHSPEED_SPI7_SIGNAL
  *   @arg SYSCFG_HIGHSPEED_SPI8_SIGNAL
  *   @arg SYSCFG_HIGHSPEED_DCMI_PSSI_DCMIPP_SIGNAL
  * @retval None
  */
void HAL_SYSCFG_EnableIOSpeedOptimize(uint32_t SYSCFG_HighSpeedSignal)
{
  SET_BIT(SYSCFG->IOCR, SYSCFG_HighSpeedSignal) ;
}

/**
  * @brief  To Disable optimize the I/O speed when the product voltage is low.
  * @note   This bit is active only if PRODUCT_BELOW_25V user option bit is set. It must be
  *         used only if the product supply voltage is below 2.5 V. Setting this bit when VDD is
  *         higher than 2.5 V might be destructive.
  * @param  SYSCFG_HighSpeedSignal: Signal selection (TRACE, OCTOSPI...)
  *   This parameter can be one or a combination of the following values:
  *   @arg SYSCFG_HIGHSPEED_TRACE_SIGNAL
  *   @arg SYSCFG_HIGHSPEED_LCD_SIGNAL
  *   @arg SYSCFG_HIGHSPEED_OCTOSPIM_P1_SIGNAL
  *   @arg SYSCFG_HIGHSPEED_OCTOSPIM_P2_SIGNAL
  *   @arg SYSCFG_HIGHSPEED_ETH1_SIGNAL
  *   @arg SYSCFG_HIGHSPEED_ETH2_SIGNAL
  *   @arg SYSCFG_HIGHSPEED_ETH3_SIGNAL
  *   @arg SYSCFG_HIGHSPEED_SDMMC3_SIGNAL
  *   @arg SYSCFG_HIGHSPEED_SPI1_SIGNAL
  *   @arg SYSCFG_HIGHSPEED_SPI2_SIGNAL
  *   @arg SYSCFG_HIGHSPEED_SPI3_SIGNAL
  *   @arg SYSCFG_HIGHSPEED_SPI4_SIGNAL
  *   @arg SYSCFG_HIGHSPEED_SPI5_SIGNAL
  *   @arg SYSCFG_HIGHSPEED_SPI6_SIGNAL
  *   @arg SYSCFG_HIGHSPEED_SPI7_SIGNAL
  *   @arg SYSCFG_HIGHSPEED_SPI8_SIGNAL
  *   @arg SYSCFG_HIGHSPEED_DCMI_PSSI_DCMIPP_SIGNAL
  * @retval None
  */
void HAL_SYSCFG_DisableIOSpeedOptimize(uint32_t SYSCFG_HighSpeedSignal)
{
  CLEAR_BIT(SYSCFG->IOCR, SYSCFG_HighSpeedSignal) ;
}
#endif /* SYSCFG_IOCR_HSLVEN_TRACE */

/**
  * @brief  Lock the SYSCFG item(s).
  * @note   Setting lock(s) depends on privilege mode in secure/non-secure code
  *         Lock(s) cleared only at system reset
  * @param  Item Item(s) to set lock on.
  * This parameter can be a combination of @ref SYSCFG_Lock_items
  *   @arg SYSCFG_SAU
  *   @arg SYSCFG_MPU_SEC
  *   @arg SYSCFG_MPU_NSEC
  *   @arg SYSCFG_VTOR_NSEC
  *   @arg SYSCFG_VTOR_AIRCR_SEC
  *   @arg SYSCFG_LOCK_ALL
  * @retval None
  */
void HAL_SYSCFG_Lock(uint32_t Item)
{
  assert_param(IS_SYSCFG_LOCK_SELECT(Item));
  MODIFY_REG(SYSCFG->M33SSCR, SYSCFG_LOCK_ALL, Item);
}

/**
  * @brief  Get the lock state of SYSCFG item.
  * @param  pItem pointer to return locked items
  * the return value can be a combination of @ref SYSCFG_Lock_items
  *   @arg SYSCFG_SAU
  *   @arg SYSCFG_MPU_SEC
  *   @arg SYSCFG_MPU_NSEC
  *   @arg SYSCFG_VTOR_NSEC
  *   @arg SYSCFG_VTOR_AIRCR_SEC
  *   @arg SYSCFG_LOCK_ALL
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_SYSCFG_GetLock(uint32_t *pItem)
{
  uint32_t tmp_lock;

  /* Check null pointer */
  if (pItem == NULL)
  {
    return HAL_ERROR;
  }

  /* Get the non-secure lock state */
  tmp_lock = ((READ_REG(SYSCFG->M33SSCR) >> SYSCFG_M33SSCR_LOCKSVTAIRCR_Pos) & 0x3FUL);

  /* Return overall lock status */
  *pItem = tmp_lock;

  return HAL_OK;
}

/**
  * @}
  */

#endif /* CORE_CA35 || CORE_CM33 */

/**
  * @}
  */
#endif /* HAL_MODULE_ENABLED */
/**
  * @}
  */

/**
  * @}
  */
